#!/bin/bash

echo --------------------------------------------------------------------------------------------*task3_tests
echo ----------------------------------------------*test1
diff <(bash task3.sh Пивоварение krivo) <(echo -e "KrivosheevAV\nНомера пропущенных занятий\n2, 8, 11, 13, 14, 17") -s
echo ----------------------------------------------*test2
diff <(bash task3.sh Пивоварение Makarov) <(echo -e "MakarovDanA\nНомера пропущенных занятий\n4") -s
echo ----------------------------------------------*test3
diff <(bash task3.sh Криптоварение Abo) <(echo -e "AboBA\nНомера пропущенных занятий\n1") -s
echo ----------------------------------------------*test4
diff <(bash task3.sh Криптоварение Aweso) <(echo -e "AwesomeBL\nНомера пропущенных занятий\n1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26") -s
echo ----------------------------------------------*test5
diff <(bash task3.sh Криптоварение Nice) <(echo -e "NiceDK\nНет пропущенных занятий") -s
echo ----------------------------------------------*test6
diff <(bash task3.sh Криптоварение Zuben) <(echo -e "ZubenkoMP\nНет пропущенных занятий") -s
echo ----------------------------------------------*test7
diff <(bash task3.sh Криптозоология Krivo) <(echo -e "KrivosheevAV\nНомера пропущенных занятий\n5, 14, 15, 17, 18") -s
echo ----------------------------------------------*test8
diff <(bash task3.sh Криптозоология Makarov) <(echo -e "MakarovDanA\nНомера пропущенных занятий\n11, 18") -s